### Combining Datasets: Merge and Join 

- pd.merge function

##### Relational Algebra 
- relational algebra, set of rules for manipulating data
- related join() method of Series & DataFrame

#### Categories of Joins
- one-to-one
- many-to-one
- many-to-many

##### One-to-one joins

similar to colummn-wise concatenation

In [1]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame({'employee':['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting','Engineering','Engineering','HR']})

df2 = pd.DataFrame({'employee':['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

print(df1)

print()

print(df2)

print()
print('to combine into single data frame use pd.merge() ')
print('df3 = pd.merge(df1,df2)')
print()

df3 = pd.merge(df1,df2)
df3

print()
print('recognises that each DataFrame has employee column and is treated as a key')

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

to combine into single data frame use pd.merge()
df3 = pd.merge(df1,df2)


recognises that each DataFrame has employee column and is treated as a key

##### Many-to-one joins

1 of the 2 key columns have duplicate entries
resulting DataFrame will preserve duplicate entries as appropriate

In [2]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering','HR'],
                    'supervisor':['Carly','Guido','Steve']})

print(df3)
print()
print(df4)
print()
print(pd.merge(df3,df4))
print()
print('DataFrame has additional column supervisor info, information is repeated in one or more locations as required')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

DataFrame has additional column supervisor info, information is repeated in one or more locations as required

#### Specification of the Merge key

- default of pd.merge(): 
    one or more matching column names as key
    
##### the on keyword
- specify the name of the key column using 'on' keyword
- works only if the left & right DataFrames have the same specified column name

In [3]:
print(df1)
print()
print(df2)
print()
print('pd.merge(df1,df2, on= "employee" )')
print()
print(pd.merge(df1,df2, on= 'employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1,df2, on= "employee" )

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

##### The left_on and right_on keywords

- merge two datasets with different column names
- e.g. dataset for column name 'name' & another 'employee'
- left_on and right_on keywords to specify column names
- then use drop() to remove the redundant column

In [4]:
df3 = pd.DataFrame({'name':['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

print(df1)
print()
print(df3)
print()

print("pd.merge(df1,df3, left_on='employee', right_on='name')")
print()
print(pd.merge(df1,df3, left_on='employee', right_on='name'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1,df3, left_on='employee', right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [5]:
# drop() method on the redundant column

pd.merge(df1, df3, left_on='employee', right_on='name').drop('name',axis=1)
#drop 'name' column

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

##### The left_index and right_index keywords

- instead of merging on column
- merge on an index
- treat index as key by merging the left_index and right_index flags in pd.merge()

In [6]:
#convert the column to index

df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

print(df1a)
print()
print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [7]:
# use the index as key by merging by specifying
# left_index and right_index flags as pd.merge()

print(df1a)
print()
print(df2a)
print()
print("pd.merge(df1a,df2a, left_index=True, right_index=True)")
print()
print(pd.merge(df1a,df2a, left_index=True, right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a,df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [8]:
# DataFrames implement the join() method
# join default joining on indices

print('df1a.join(df2a)')
print(df1a.join(df2a))

df1a.join(df2a)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [10]:
# Mix indices and columns
# combine left_index and right_index

print(df1a)
print()
print(df3)
print()
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

##### Specifying Set Arithmetic for Joins

In [11]:
df6 = pd.DataFrame({'name':['Peter', 'Paul', 'Mary'],
                   'food': ['fish','beans', 'bread']},
                  columns =['name', 'food'])

df7 = pd.DataFrame({ 'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                  columns = ['name', 'drink'])

print(df6)
print()
print(df7)
print()
print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

   name   food drink
0  Mary  bread  wine

In [12]:
# merge the 2 datasets contains the intersection of 2 DataFrames
# it is default as an inner join

pd.merge(df6, df7, how= 'inner')
#same output as the above

   name   food drink
0  Mary  bread  wine

In [15]:
# how keywords are 'inner', 'outer', 'left', 'right'

#outer join returns a join over the union of input columns

print(df6)
print()
print(df7)
print()
print(pd.merge(df6, df7, how='outer'))

# there will be NaN for both sides

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [16]:
# how = 'right'

print(df6)
print()
print(df7)
print()
print(pd.merge(df6, df7, how='right'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [17]:
# how = 'left'

print(df6)
print()
print(df7)
print()
print(pd.merge(df6, df7, how='left'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

##### Overlapping Column Names: The Suffixes Keywords

In [18]:
# conflicing column names

df8 = pd.DataFrame({'name':['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [1, 2, 3, 4]})

df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [3, 1, 4, 2]})

print(df8)
print()
print(df9)
print()
print(pd.merge(df8, df9, on='name'))

#merge function automatically appends suffix_x or _ y to make the output columns unique

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [19]:
#alternative can assign custom suffixe using
# suffixes keyword

print(df8)
print()
print(df9)
print()
print(pd.merge(df8, df9, on='name', suffixes = ['_L','_R']))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

##### Example: US state Data

In [23]:
#using Pandas read_csv() function:

pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

print(pop.head())
print()
print(areas.head())
print()
print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [25]:
#compute a straightforward result:
# rank US states and territories by their 2010 population density

# combine datasets
# using many-to-one merge with full name state within pop DataFrame
# merge based on state/region column of pop
# abbreviation of abbrevs
# use how = 'outer' to make sure no data thrown away

merged = pd.merge(pop, abbrevs, how = 'outer',
                 left_on = 'state/region', right_on='abbreviation')

merged = merged. drop('abbreviation', 1) #drop duplicate info
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [26]:
#double-check if there are any mismatches, check for looking for rows with nulls

merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [28]:
#some of the popualtion info is null, find out!

merged[merged['population'].isnull()].head()

#null population values are from Puerto Rico 
#this could be because data not available from the original source

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [29]:
# new state entries are also null
# no corresponding entry in the abbrevs key
# the state column in abbrevs have #N/A

merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [30]:
#infer that entries do not appear in the state abbreviation key
# quickly by filling in appropriate entries

merged.loc[merged['state/region']=='PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region']=='USA', 'state'] = 'United States'
merged.isnull().any()

# No more nulls in state column
# merge the result with area data using state column

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [31]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [32]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [33]:
#there are nulls in the area column, 
#look to see which regions are ignored

final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [34]:
#DataFrame does not contain the area of United States as a whole
#drop the null values because population density of US not important

final.dropna(inplace = True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [35]:
data2010 = final.query("year == 2010 & ages == 'total' ")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [36]:
#compute population density and display in order
#reindexing the data on the state
#then compute the result

data2010.set_index('state', inplace=True)
density = data2010['population']/data2010['area (sq. mi)']

density.sort_values(ascending = False, inplace = True)
density.head()
#ranking of the top 5 highest density

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [37]:
#check end of the list

density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64